#include <iostream>

int main()
{
    //코드 시작점
    /*

     주석

    */

    //단축키
    //ctrl+D = 문장 복사
    //alt+shift+드래그 = 세로 다중 선택
    //ctrl+arrow = 단어 단위로 건너뛰기
    //ctrl+space = 인텔리센스 재활성화
    //alt+Up/Down = 현재 줄 위아래로 옮기기
    //F5 = 디버그로 시작
    //F9 = 브레이크 포인트 설정/해제

    printf("Hello World!\n"); //줄바꿈
    printf("Hello\t World!\n"); //tab
    printf("\"Hello World!\"\n"); //큰 따옴표
    printf("Hello World!\n"); //줄바꿈

    std::cout <<
        "                    .^~!!~:.                     \n"
        "                  7G&@@@@@#G5~            ...    \n"
        "                .P@@@@@@@@BG&@P.          ...    \n"
        "                ?@@@@@@@@@@@@@@G.                \n"
        "                5@5YG@@&5?7Y&@@@~                \n"
        "                55JP~B@?^BP^P@@@!                \n"
        "                YB?P7!!!!P5~B@@@7                \n"
        "                ?&?!~~^^^~!7B@&@5                \n"
        "                ~@J??7!77?7!P@GP&7               \n"
        "               .P#^~7??7!^...P@#@@J              \n"
        "             .?&P: .:::.      P@@@@G~            \n"
        "            !#@P           ...^&@@@@@P^          \n"
        "           J@@@!.   ..    ..:::!G@&&@@&!         \n"
        "          ~&&#~                ..P&B#&@@!        \n"
        "         :B&&^                   :#&&B@@#.       \n"
        "        ^#&@?      ..             G@@B@@@J       \n"
        "       ^&@B&:      .              P@&#@@@G       \n"
        "       ~B5PG^      .            ..B@&&&B&Y       \n"
        "   ...:!!~~7GP!.   .           ^7~P@@@@#5~       \n"
        "  ^7!!!!~~~~!5@#J^            :!7~?GBBP?~!^      \n"
        "  ^7~~~~~~~~~~?&@@!           ^?7~~!!!~~~~~^:    \n"
        "  ^7~~~~~~~~~~~75?.         :?#G7~~~~~~~~~~!77.  \n"
        " .?!~~~~~~~~~~~~!?7!^::^^!JP&@@57~~~~~~!7??7!:   \n"
        " .!7777777!!~~~~7YB&#BBB#&@@@@&5?!!!7?JJ!^.      \n"
        "    ..:^~!77???JYJ^.......::^!7YP55YY?~.         \n"
        "            .^~~^               :~!~:            \n";


}
#pragma once
